## staging: rds
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 9 to add, 1 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                             NAME                             |
|--------|--------------------------------------------------------------|
| add    | `aws_rds_cluster_parameter_group.postgres16`                 |
|        | `module.rds_proxy.aws_cloudwatch_log_group.this[0]`          |
|        | `module.rds_proxy.aws_db_proxy.this[0]`                      |
|        | `module.rds_proxy.aws_db_proxy_default_target_group.this[0]` |
|        | `module.rds_proxy.aws_db_proxy_endpoint.this[&quot;read_only&quot;]`   |
|        | `module.rds_proxy.aws_db_proxy_endpoint.this[&quot;read_write&quot;]`  |
|        | `module.rds_proxy.aws_db_proxy_target.db_cluster[0]`         |
|        | `module.rds_proxy.aws_iam_role.this[0]`                      |
|        | `module.rds_proxy.aws_iam_role_policy.this[0]`               |
| update | `aws_rds_cluster.notification-canada-ca`                     |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_rds_cluster.notification-canada-ca will be updated in-place
  ~ resource "aws_rds_cluster" "notification-canada-ca" {
      ~ db_cluster_parameter_group_name       = "default.aurora-postgresql16" -> "rds-cluster-pg-16"
      + enable_local_write_forwarding         = false
        id                                    = "notification-canada-ca-staging-cluster"
        tags                                  = {
            "CostCenter" = "notification-canada-ca-staging"
        }
        # (55 unchanged attributes hidden)
    }

  # aws_rds_cluster_parameter_group.postgres16 will be created
  + resource "aws_rds_cluster_parameter_group" "postgres16" {
      + arn         = (known after apply)
      + description = "RDS customized cluster parameter group"
      + family      = "aurora-postgresql16"
      + id          = (known after apply)
      + name        = "rds-cluster-pg-16"
      + name_prefix = (known after apply)
      + tags        = {
          + "CostCenter" = "notification-canada-ca-staging"
        }
      + tags_all    = {
          + "CostCenter" = "notification-canada-ca-staging"
        }

      + parameter {
          + apply_method = "immediate"
          + name         = "log_connections"
          + value        = "1"
        }
      + parameter {
          + apply_method = "immediate"
          + name         = "log_disconnections"
          + value        = "1"
        }
      + parameter {
          + apply_method = "immediate"
          + name         = "log_min_error_statement"
          + value        = "debug5"
        }
      + parameter {
          + apply_method = "immediate"
          + name         = "log_statement"
          + value        = "ddl"
        }
      + parameter {
          + apply_method = "pending-reboot"
          + name         = "rds.log_retention_period"
          + value        = "4320"
        }
      + parameter {
          + apply_method = "pending-reboot"
          + name         = "rds.logical_replication"
          + value        = "1"
        }
    }

  # module.rds_proxy.aws_cloudwatch_log_group.this[0] will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/rds/proxy/rds-proxy"
      + name_prefix       = (known after apply)
      + retention_in_days = 30
      + skip_destroy      = false
      + tags              = {
          + "CostCenter" = "notification-canada-ca-staging"
        }
      + tags_all          = {
          + "CostCenter" = "notification-canada-ca-staging"
        }
    }

  # module.rds_proxy.aws_db_proxy.this[0] will be created
  + resource "aws_db_proxy" "this" {
      + arn                    = (known after apply)
      + debug_logging          = false
      + endpoint               = (known after apply)
      + engine_family          = "POSTGRESQL"
      + id                     = (known after apply)
      + idle_client_timeout    = 1800
      + name                   = "rds-proxy"
      + require_tls            = true
      + role_arn               = (known after apply)
      + tags                   = {
          + "CostCenter" = "notification-canada-ca-staging"
        }
      + tags_all               = {
          + "CostCenter" = "notification-canada-ca-staging"
        }
      + vpc_security_group_ids = [
          + "sg-0e2c3ef6c5c75b74c",
        ]
      + vpc_subnet_ids         = [
          + "subnet-001e585d12cce4d1e",
          + "subnet-08de34a9e1a7458dc",
          + "subnet-0af8b8402f1d605ff",
        ]

      + auth {
          + auth_scheme               = "SECRETS"
          + client_password_auth_type = (known after apply)
          + description               = "Database superuser app_db_user, database connection values"
          + iam_auth                  = "DISABLED"
          + secret_arn                = "arn:aws:secretsmanager:ca-central-1:239043911459:secret:app_db_user-NwdRDQ"
            # (1 unchanged attribute hidden)
        }
      + auth {
          + auth_scheme               = "SECRETS"
          + client_password_auth_type = (known after apply)
          + description               = "Database superuser postgres, database connection values"
          + iam_auth                  = "DISABLED"
          + secret_arn                = "arn:aws:secretsmanager:ca-central-1:239043911459:secret:postgres-eDOk4f"
            # (1 unchanged attribute hidden)
        }
    }

  # module.rds_proxy.aws_db_proxy_default_target_group.this[0] will be created
  + resource "aws_db_proxy_default_target_group" "this" {
      + arn           = (known after apply)
      + db_proxy_name = "rds-proxy"
      + id            = (known after apply)
      + name          = (known after apply)

      + connection_pool_config {
          + connection_borrow_timeout    = 120
          + max_connections_percent      = 90
          + max_idle_connections_percent = 50
            # (1 unchanged attribute hidden)
        }
    }

  # module.rds_proxy.aws_db_proxy_endpoint.this["read_only"] will be created
  + resource "aws_db_proxy_endpoint" "this" {
      + arn                    = (known after apply)
      + db_proxy_endpoint_name = "read-only-endpoint"
      + db_proxy_name          = "rds-proxy"
      + endpoint               = (known after apply)
      + id                     = (known after apply)
      + is_default             = (known after apply)
      + tags                   = {
          + "CostCenter" = "notification-canada-ca-staging"
        }
      + tags_all               = {
          + "CostCenter" = "notification-canada-ca-staging"
        }
      + target_role            = "READ_ONLY"
      + vpc_id                 = (known after apply)
      + vpc_security_group_ids = [
          + "sg-0e2c3ef6c5c75b74c",
        ]
      + vpc_subnet_ids         = [
          + "subnet-001e585d12cce4d1e",
          + "subnet-08de34a9e1a7458dc",
          + "subnet-0af8b8402f1d605ff",
        ]
    }

  # module.rds_proxy.aws_db_proxy_endpoint.this["read_write"] will be created
  + resource "aws_db_proxy_endpoint" "this" {
      + arn                    = (known after apply)
      + db_proxy_endpoint_name = "read-write-endpoint"
      + db_proxy_name          = "rds-proxy"
      + endpoint               = (known after apply)
      + id                     = (known after apply)
      + is_default             = (known after apply)
      + tags                   = {
          + "CostCenter" = "notification-canada-ca-staging"
        }
      + tags_all               = {
          + "CostCenter" = "notification-canada-ca-staging"
        }
      + target_role            = "READ_WRITE"
      + vpc_id                 = (known after apply)
      + vpc_security_group_ids = [
          + "sg-0e2c3ef6c5c75b74c",
        ]
      + vpc_subnet_ids         = [
          + "subnet-001e585d12cce4d1e",
          + "subnet-08de34a9e1a7458dc",
          + "subnet-0af8b8402f1d605ff",
        ]
    }

  # module.rds_proxy.aws_db_proxy_target.db_cluster[0] will be created
  + resource "aws_db_proxy_target" "db_cluster" {
      + db_cluster_identifier = "notification-canada-ca-staging-cluster"
      + db_proxy_name         = "rds-proxy"
      + endpoint              = (known after apply)
      + id                    = (known after apply)
      + port                  = (known after apply)
      + rds_resource_id       = (known after apply)
      + target_arn            = (known after apply)
      + target_group_name     = (known after apply)
      + tracked_cluster_id    = (known after apply)
      + type                  = (known after apply)
    }

  # module.rds_proxy.aws_iam_role.this[0] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "rds.amazonaws.com"
                        }
                      + Sid       = "RDSAssume"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 43200
      + name                  = "rds-proxy-to-secrets-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "CostCenter" = "notification-canada-ca-staging"
        }
      + tags_all              = {
          + "CostCenter" = "notification-canada-ca-staging"
        }
      + unique_id             = (known after apply)
        # (1 unchanged attribute hidden)

      + inline_policy (known after apply)
    }

  # module.rds_proxy.aws_iam_role_policy.this[0] will be created
  + resource "aws_iam_role_policy" "this" {
      + id          = (known after apply)
      + name        = "rds-proxy-to-secrets-policy"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "kms:Decrypt"
                      + Condition = {
                          + StringEquals = {
                              + "kms:ViaService" = "secretsmanager.ca-central-1.amazonaws.com"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "arn:aws:kms:ca-central-1:239043911459:key/a92df413-fc30-4f3e-8047-7433e1a8ad02"
                      + Sid       = "DecryptSecrets"
                    },
                  + {
                      + Action   = [
                          + "secretsmanager:ListSecrets",
                          + "secretsmanager:GetRandomPassword",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "ListSecrets"
                    },
                  + {
                      + Action   = [
                          + "secretsmanager:ListSecretVersionIds",
                          + "secretsmanager:GetSecretValue",
                          + "secretsmanager:GetResourcePolicy",
                          + "secretsmanager:DescribeSecret",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:secretsmanager:ca-central-1:239043911459:secret:postgres-eDOk4f",
                          + "arn:aws:secretsmanager:ca-central-1:239043911459:secret:app_db_user-NwdRDQ",
                        ]
                      + Sid      = "GetSecrets"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

Plan: 9 to add, 1 to change, 0 to destroy.

Changes to Outputs:
  + database_read_only_proxy_endpoint  = (known after apply)
  + database_read_write_proxy_endpoint = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.logs_exports"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.db-free-local-storage-critical[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.db-free-local-storage-critical[1]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.db-free-local-storage-critical[2]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.db-free-local-storage-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.db-free-local-storage-warning[1]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.db-free-local-storage-warning[2]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.high-db-cpu-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.high-db-cpu-warning[1]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.high-db-cpu-warning[2]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.high-dbload-critical[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.high-dbload-critical[1]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.high-dbload-critical[2]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.high-dbload-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.high-dbload-warning[1]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.high-dbload-warning[2]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.low-db-memory-critical[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.low-db-memory-critical[1]"]
WARN - plan.json - main - Missing Common Tags:...
```

</details>
